Setting up workspace

In [68]:
# feel free to just use the following if you prefer...
import pandas as pd
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv"
df = pd.read_csv(url)
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

Below is code provided by ChatGpt

In [69]:
df = pd.read_csv(url)

# Get the number of rows and columns
rows, columns = df.shape

# Display the result
print(f"The dataset has {rows} rows and {columns} columns.")

The dataset has 891 rows and 15 columns.

An observation is a single object in a dataset. For example, given a dataset recording various traits of university students, the traits of a single student would be considered an observation.  

A variable is a trait measured by a dataset. Using the example above, something like "age" would be a variable.

In [70]:
print("### DataFrame Info ###")
df.info()

print("\n### Descriptive Statistics (Numerical) ###")
print(df.describe())

print("\n### Descriptive Statistics (All Columns) ###")
print(df.describe(include='all'))

print("\n### First 5 Rows of the DataFrame ###")
print(df.head())

print("\n### Last 5 Rows of the DataFrame ###")
print(df.tail())

print("\n### Column Names ###")
print(df.columns)

print("\n### Missing Values Per Column ###")
print(df.isnull().sum())

### DataFrame Info ###
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

### Descriptive Statistics (Numerical) ###
         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

### Descriptive Statistics (All Columns) ###
          survived      pclass   sex         age       sibsp       parch  \
count   891.000000  891.000000   891  714.000000  891.000000  891.000000
unique         NaN         NaN     2         NaN         NaN         NaN
top            NaN         NaN  male         NaN         NaN         NaN
freq           NaN         NaN   577         NaN         NaN         NaN
mean      0.383838    2.308642   NaN   29.699118    0.523008    0.381594
std       0.486592    0.836071   NaN   14.526497    1.102743    0.806057
min       0.000000    1.000000   NaN    0.420000    0.000000    0.000000
25%       0.000000    2.000000   NaN   20.125000    0.000000    0.000000
50%       0.000000    3.000000   NaN   28.000000    0.000000    0.000000
75%       1.000000    3.000000   NaN   38.000000    1.000000    0.000000
max       1.000000    3.000000   NaN   80.000000    8.000000    6.000000

              fare embarked  class  who adult_male deck  embark_town alive  \
count   891.000000      889    891  891        891  203          889   891
unique         NaN        3      3    3          2    7            3     2
top            NaN        S  Third  man       True    C  Southampton    no
freq           NaN      644    491  537        537   59          644   549
mean     32.204208      NaN    NaN  NaN        NaN  NaN          NaN   NaN
std      49.693429      NaN    NaN  NaN        NaN  NaN          NaN   NaN
min       0.000000      NaN    NaN  NaN        NaN  NaN          NaN   NaN
25%       7.910400      NaN    NaN  NaN        NaN  NaN          NaN   NaN
50%      14.454200      NaN    NaN  NaN        NaN  NaN          NaN   NaN
75%      31.000000      NaN    NaN  NaN        NaN  NaN          NaN   NaN
max     512.329200      NaN    NaN  NaN        NaN  NaN          NaN   NaN

       alone
count    891
unique     2
top     True
freq     537
mean     NaN
std      NaN
min      NaN
25%      NaN
50%      NaN
75%      NaN
max      NaN

### First 5 Rows of the DataFrame ###
   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

### Last 5 Rows of the DataFrame ###
     survived  pclass     sex   age  sibsp  parch   fare embarked   class  \
886         0       2    male  27.0      0      0  13.00        S  Second
887         1       1  female  19.0      0      0  30.00        S   First
888         0       3  female   NaN      1      2  23.45        S   Third
889         1       1    male  26.0      0      0  30.00        C   First
890         0       3    male  32.0      0      0   7.75        Q   Third

       who  adult_male deck  embark_town alive  alone
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

### Column Names ###
Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

### Missing Values Per Column ###
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

Data for P4

In [71]:
print("output from shape")
print(df.shape)

output from shape
(891, 15)

In [72]:
print("output from describe")
print(df.describe())

output from describe
         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

According to shape there are 15 columms, but only 6 were displayed by describe
What most likely happened is that describe only displayed the columms with numerical values
since all the values in the displayed columms are numerical

Q5

An attribute is a variable of an object or class that holds data about the object/class
Ex: An object "human" might have various attributes including blood type, height, weight, etc
    
A method is a function tied to an object or class, and can be run by the object/class
Ex: The object "Human" might have a method called "eat"

6. The df.describe() method provides the 'count', 'mean', 'std', 'min', '25%', '50%', '75%', and 'max' summary statistics for each variable it analyzes. Give the definitions (perhaps using help from the ChatBot if needed) of each of these summary statistics

count: Total number of variables in a column 
mean: sum of all variables in a column divided by number of variables in the column
std: standard deviation of all values in a column
min: minimum value in a column
25%: 25th percentile of a column
50%: 50th percentile of a column
75%: 75th percentile of a column
max: maximum value in a column

1. Provide an example of a "use case" in which using df.dropna() might be peferred over using del df['col']

Suppose you have a mostly full dataset with random empty values scattered through. By using df.dropna, you can target and remove only the locations with missing data, so no additional data gets deleted.
If you were to use del df['col'], entire, mostly complete columns of data would be deleted.


2. Provide an example of "the opposite use case" in which using del df['col'] might be preferred over using df.dropna()

Suppose instead of having a mostly full dataset you have a mostly empty dataset and the empty spots happen to be generally clumped into the same columns. 
Using df.dropna() to clear the empty space would take a long time as you need to individually target each one. def['col'] however could delete a whole empty column at once, making it the more efficient option. 

3. Discuss why applying del df['col'] before df.dropna() when both are used together could be important

To avoid wasting time going through empty columns with the less efficient df.dropna.


4. Remove all missing data from one of the datasets you're considering using some combination of del df['col'] and/or df.dropna() and give a justification for your approach, including a "before and after" report of the results of your approach for your dataset.

In [73]:
print("\n### Missing Values Per Column ###")
print(df.isnull().sum())

### Missing Values Per Column ###
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [74]:
rows_with_nan = df[df.isnull().any(axis=1)]

print("Rows with any NaN values:")
print(rows_with_nan)

Rows with any NaN values:
     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
2           1       3  female  26.0      0      0   7.9250        S   Third
4           0       3    male  35.0      0      0   8.0500        S   Third
5           0       3    male   NaN      0      0   8.4583        Q   Third
7           0       3    male   2.0      3      1  21.0750        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
884         0       3    male  25.0      0      0   7.0500        S   Third
885         0       3  female  39.0      0      5  29.1250        Q   Third
886         0       2    male  27.0      0      0  13.0000        S  Second
888         0       3  female   NaN      1      2  23.4500        S   Third
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
2    woman       False  NaN  Southampton   yes   True
4      man        True  NaN  Southampton    no   True
5      man        True  NaN   Queenstown    no   True
7    child       False  NaN  Southampton    no  False
..     ...         ...  ...          ...   ...    ...
884    man        True  NaN  Southampton    no   True
885  woman       False  NaN   Queenstown    no  False
886    man        True  NaN  Southampton    no   True
888  woman       False  NaN  Southampton    no  False
890    man        True  NaN   Queenstown    no   True

[709 rows x 15 columns]

In [75]:
del df['age']
del df['deck']
df_cleaned = df.dropna()

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [76]:
print("\n### Missing Values Per Column ###")
print(df.isnull().sum())

rows_with_nan = df[df.isnull().any(axis=1)]

print("Rows with any NaN values:")
print(rows_with_nan)

### Missing Values Per Column ###
survived       0
pclass         0
sex            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
embark_town    2
alive          0
alone          0
dtype: int64
Rows with any NaN values:
     survived  pclass     sex  sibsp  parch  fare embarked  class    who  \
61          1       1  female      0      0  80.0      NaN  First  woman
829         1       1  female      0      0  80.0      NaN  First  woman

     adult_male embark_town alive  alone
61        False         NaN   yes   True
829       False         NaN   yes   True

Below is Q8

In [80]:
result = df.groupby("class")["pclass"].describe()
print(result)

        count  mean  std  min  25%  50%  75%  max
class
First   216.0   1.0  0.0  1.0  1.0  1.0  1.0  1.0
Second  184.0   2.0  0.0  2.0  2.0  2.0  2.0  2.0
Third   491.0   3.0  0.0  3.0  3.0  3.0  3.0  3.0

groupby only counts items in specific groups (Here those groups are give by "class" and "pclass")
descibe shows you the number of non-missing values for every group in a column

In [ ]:
3.

Using the ChatBot session is much easier, since the bot explains and provides the correct code in the same place compared to something like stack overflow, where the explanations vary from PhD degree level of technicality to completely wrong. 
Chatbots also allow you to troubleshoot immediately after you try a potentially wrong solution which is very valuable.

In [ ]:
Somewhat

In [ ]:
Chat gpt link: https://chatgpt.com/share/5878d860-40d9-4b25-ada7-ec02ba234975